title: Suspicious Process Creation
id: 6f4191bb-912b-48a8-9ce7-682769541e6d
description: Detects suspicious process creation events
author: naphal@zerodayfri.day
logsource:
  category: process_access
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith:
      - '\powershell.exe'
      - '\cmd.exe'
    CommandLine|contains:
      - '-encodedcommand'
      - 'IEX'
      - 'Invoke-Expression'
  condition: selection
